IDENTIFICATION DIVISION.
       PROGRAM-ID. MYINFO.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-NAME        PIC A(20) VALUE 'Daria'.
       01 WS-CITY        PIC A(20) VALUE 'NICE'.
       01 WS-PROFESSION  PIC A(30) VALUE 'COBOL AND AI SPECIALIST'.

       PROCEDURE DIVISION.
           DISPLAY 'Name: ' WS-NAME
           DISPLAY 'City: ' WS-CITY
           DISPLAY 'Profession: ' WS-PROFESSION
           STOP RUN.
